app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @book_comment = BookComment.new(book_comment_params)
    @book_comment.book_id = @book.id
    @book_comment.user_id = current_user.id
    @book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["book_id", 2], ["comment", ",smcjbvlasfdvafv"], ["created_at", "2021-07-08 10:26:00.642385"], ["updated_at", "2021-07-08 10:26:00.642385"]]